; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l7_p7_c7_g7)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    loc7 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    person7 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate
    crate7 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)
    (at-crate crate7 depot)
    (at-person person1 loc6)
    (at-person person2 loc5)
    (at-person person3 loc3)
    (at-person person4 loc7)
    (at-person person5 loc4)
    (at-person person6 loc3)
    (at-person person7 loc4)
    (crate-content crate1 food)
    (crate-content crate2 food)
    (crate-content crate3 food)
    (crate-content crate4 medicine)
    (crate-content crate5 medicine)
    (crate-content crate6 medicine)
    (crate-content crate7 medicine)
  )
  (:goal (and
    (has-content person2 medicine)
    (has-content person3 medicine)
    (has-content person4 food)
    (has-content person4 medicine)
    (has-content person5 food)
    (has-content person5 medicine)
    (has-content person6 food)
  ))
)

; plan
1. (pick-up drone1 left crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate3)
   goals met: 0 of 7
2. (pick-up drone1 right crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate4)
   goals met: 0 of 7
3. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 0 of 7
4. (deliver drone1 left crate3 person6 loc3 food)
   deleted: (holding drone1 left crate3)
   added: (hand-empty drone1 left) (has-content person6 food)
   goals met: 1 of 7
5. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 1 of 7
6. (pick-up drone1 left crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate2)
   goals met: 1 of 7
7. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 1 of 7
8. (deliver drone1 left crate2 person5 loc4 food)
   deleted: (holding drone1 left crate2)
   added: (hand-empty drone1 left) (has-content person5 food)
   goals met: 2 of 7
9. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 2 of 7
10. (pick-up drone1 left crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate1)
   goals met: 2 of 7
11. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 2 of 7
12. (deliver drone1 left crate1 person4 loc7 food)
   deleted: (holding drone1 left crate1)
   added: (hand-empty drone1 left) (has-content person4 food)
   goals met: 3 of 7
13. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 3 of 7
14. (pick-up drone1 left crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate5)
   goals met: 3 of 7
15. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 3 of 7
16. (deliver drone1 left crate5 person3 loc3 medicine)
   deleted: (holding drone1 left crate5)
   added: (hand-empty drone1 left) (has-content person3 medicine)
   goals met: 4 of 7
17. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 4 of 7
18. (pick-up drone1 left crate7 depot)
   deleted: (at-crate crate7 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate7)
   goals met: 4 of 7
19. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 4 of 7
20. (deliver drone1 left crate7 person2 loc5 medicine)
   deleted: (holding drone1 left crate7)
   added: (hand-empty drone1 left) (has-content person2 medicine)
   goals met: 5 of 7
21. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 5 of 7
22. (pick-up drone1 left crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate6)
   goals met: 5 of 7
23. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 5 of 7
24. (deliver drone1 left crate6 person5 loc4 medicine)
   deleted: (holding drone1 left crate6)
   added: (hand-empty drone1 left) (has-content person5 medicine)
   goals met: 6 of 7
25. (fly drone1 loc4 loc7)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc7)
   goals met: 6 of 7
26. (deliver drone1 right crate4 person4 loc7 medicine)
   deleted: (holding drone1 right crate4)
   added: (hand-empty drone1 right) (has-content person4 medicine)
   goals met: 7 of 7
